Example 4 (Intel Visual Fortran)
Remarks
This example is written for Intel Visual Fortran with Microsoft Visual Studio Integration. It is based on the SAP2000 verification problem Example 1-001.
This example creates the example verification problem from scratch, runs the analysis, extracts results, and compares the results with hand-calculated values.
Example
Create an empty Intel Fortran project.
Using the Intel Fortran Module Wizard (under Tools menu), browse for "C:\Program Files\Computers and Structures\SAP2000 22\SAP2000v1.TLB". Modify the path as appropriate for CSiBridge or if you have installed the program in a different location. If the TLB is missing from the installed program directory, an error occurred during installation. Please uninstall the program, restart your computer, and re-install with full administrative rights.
Once you have selected SAP2000v1.TLB, click "Next", then select all the members to generate SAP2000v1.f90. The generated module contains explicit interfaces to all objects and member functions of the SAP2000 API.
 Add an empty source file by right clicking on the “Source Files” folder in Solution Explorer and by selecting "Add>New Item>Fortran Free-form File (.f90)".Source.
Open the empty source file and paste in the following code. Please pay attention to the comments in this code block; they contain important information about running the script.
 program APIExample
 use Sap2000 ! gives access to SAP2000 API calls
 implicit none
 !parameters
 integer(kind=4), parameter :: nDimCON = 1 ! array dimension
 !local variables
 integer(kind=INT_PTR_KIND()) :: pHelper ! pointer to OAPI helper object
  integer(kind=INT_PTR_KIND()) :: pSapObject ! pointer to a Sap object
  integer(kind=INT_PTR_KIND()) :: pSapModel ! pointer to a model object
  integer(kind=INT_PTR_KIND()) :: pFile ! pointer to a file object
  integer(kind=INT_PTR_KIND()) :: pPropMaterial ! pointer to a material property object
  integer(kind=INT_PTR_KIND()) :: pPropFrame ! pointer to a model object
  integer(kind=INT_PTR_KIND()) :: pFrameObj ! pointer to a frame object
  integer(kind=INT_PTR_KIND()) :: pView ! pointer to a view object
  integer(kind=INT_PTR_KIND()) :: pPointObj ! pointer to a point object
  integer(kind=INT_PTR_KIND()) :: pLoadPatterns ! pointer to a load patterns object
  integer(kind=INT_PTR_KIND()) :: pAnalyze ! pointer to an analyze object
  integer(kind=INT_PTR_KIND()) :: pAnalysisResults ! pointer to a analysis results object
  integer(kind=INT_PTR_KIND()) :: pAnalysisResultsSetup ! pointer to a setup object
  integer(kind=4) :: iStatus ! error code returned from COM subsystem
  integer(kind=4) :: iRet ! error code returned from SAP2000 API calls
  integer(kind=4) :: iCol
  integer(kind=4) :: iUnits
  integer(kind=4) :: iColor
  integer(kind=4) :: iWindow
  integer(kind=4) :: iItemType
  integer(kind=4) :: iTypleLoadPat
  integer(kind=4) :: iMyType
  integer(kind=4) :: iDir
  integer(kind=4) :: iNumberResults
  real(kind=8) :: dE
  real(kind=8) :: dU
  real(kind=8) :: dA
  real(kind=8) :: dTemp
  real(kind=8) :: dT3
  real(kind=8) :: dT2
  real(kind=8) :: dModValue
  real(kind=8) :: dXi
  real(kind=8) :: dYi
  real(kind=8) :: dZi
  real(kind=8) :: dXj
  real(kind=8) :: dYj
  real(kind=8) :: dZj
  real(kind=8) :: dSelfWTMultiplier
  real(kind=8) :: dDist1
  real(kind=8) :: dDist2
  real(kind=8) :: dVal1
  real(kind=8) :: dVal2
  real(kind=8) :: dSapResultsRA1(7)
  real(kind=8) :: dIndResultsRA1(7)
  logical(kind=2) :: bAttachToInstance
  logical(kind=2) :: bVisible
  logical(kind=2) :: bFileSave
  logical(kind=2) :: bZoom
  logical(kind=2) :: bRestrained
  logical(kind=2) :: bAddLoadCase
  logical(kind=2) :: bReplace
  logical(kind=2) :: bRelDist
  logical(kind=2) :: bSelected
  character(len=256) :: cProgramPath
  character(len=256) :: cModelPath
  character(len=256) :: cNotes
  character(len=256) :: cGUID
  character(len=256) :: cCsys
  character(len=256) :: cLoadPat
  character(len=256) :: cFrameName(3)
  character(len=256) :: cPointName(2)
  ! pointers to SafeArrays
  type(SA_BOUNDS) :: saBounds ! bounds object defining for SafeArray
  integer(kind=INT_PTR_KIND()) :: pModValueSA ! property modifiers
  integer(kind=INT_PTR_KIND()) :: pRestraintSA ! restraints
  integer(kind=INT_PTR_KIND()) :: pPointLoadValueSA ! load values
  integer(kind=INT_PTR_KIND()) :: pObjSA ! object names
  integer(kind=INT_PTR_KIND()) :: pElmSA ! element names
  integer(kind=INT_PTR_KIND()) :: pLCaseSA ! load case names
  integer(kind=INT_PTR_KIND()) :: pStepTypeSA ! step type names
  integer(kind=INT_PTR_KIND()) :: pStepNumSA ! step numbers
  integer(kind=INT_PTR_KIND()) :: pU1SA ! displacements along u1
  integer(kind=INT_PTR_KIND()) :: pU2SA ! displacements along u2
  integer(kind=INT_PTR_KIND()) :: pU3SA ! displacements along u3
  integer(kind=INT_PTR_KIND()) :: pR1SA ! displacements along r1
  integer(kind=INT_PTR_KIND()) :: pR2SA ! displacements along r2
  integer(kind=INT_PTR_KIND()) :: pR3SA ! displacements along r3
  !set the following flag to true to attach to an existing instance of the program
  !otherwise a new instance of the program will be started
  bAttachToInstance = .false. ! .true. !
  !full path to the program executable
  !set it to the installation folder
  cProgramPath = 'C:\Program Files (x86)\Computers and Structures\SAP2000 21\sap2000.exe'
  !full path to the model
  !set it to an already existing folder
  cModelPath = 'C:\API\API_1-001.sdb'
  !initialize COM
  call COMInitialize(iStatus)
  if (bAttachToInstance) then
  !attach to a running instance of Sap2000
  call COMGetActiveObjectByProgID("CSI.SAP2000.API.SapObject", pSapObject, iStatus)
  call COMQueryInterface(pSapObject, IID_cOAPI, pSapObject, iStatus)
  else
    !create a new instance of Sap2000
  !create helper object
  call COMCreateObjectByGUID(CLSID_Helper, CLSCTX_ALL, IID_cHelper, pHelper, iStatus)
  !create Sap2000 object
  iStatus = $cHelper_CreateObject(pHelper, cProgramPath, pSapObject)
  !start Sap2000 application
  iUnits = eUnits_kip_in_F
  bVisible = .TRUE.
  iStatus = $cOAPI_ApplicationStart(pSapObject, iUnits, bVisible, '', iRet)
  end if
  !create SapModel object
  iStatus = $cOAPI_GetSapModel(pSapObject, pSapModel)
  !initialize model
  iUnits = eUnits_kip_in_F
  iStatus = $cSapModel_InitializeNewModel(pSapModel, iUnits, iRet)
  !create new blank model
  iStatus = $cSapModel_GetFile(pSapModel, pFile)
  iStatus = $cFile_NewBlank(pFile, iRet)
  !define material property
  iStatus = $cSapModel_GetPropMaterial(pSapModel, pPropMaterial)
  iColor  = -1
  cNotes  = ''
  cGUID  = ''
  iStatus = $cPropMaterial_SetMaterial(pPropMaterial, 'CONC', eMatType_Concrete, iColor, cNotes, cGUID, iRet)
  !assign isotropic mechanical properties to material
  dE  = 3600.
  dU  = 0.2
  dA  = 0.0000055
  dTemp  = 0.
  iStatus = $cPropMaterial_SetMPIsotropic(pPropMaterial, 'CONC', dE, dU, dA, dTemp, iRet)
  !define rectangular frame section property
  iStatus = $cSapModel_GetPropFrame(pSapModel, pPropFrame)
  dT3  = 12.
  dT2  = 12.
  iColor  = -1
  cNotes  = ''
  cGUID  = ''
  iStatus = $cPropFrame_SetRectangle(pPropFrame, 'R1', 'CONC', dT3, dT2, iColor, cNotes, cGUID, iRet)
  !define frame section property modifiers
  saBounds%lbound = 0
  saBounds%extent = 8
  pModValueSA  = SafeArrayCreate(VT_R8, nDimCON, saBounds)
  dModValue  = 1.
  do iCol = 0, 7
  iRet = SafeArrayPutElement(pModValueSA, iCol, loc(dModValue))
  end do
  dModValue = 1000.
  iRet = SafeArrayPutElement(pModValueSA, 0, loc(dModValue))
  dModValue = 0.
  iRet = SafeArrayPutElement(pModValueSA, 1, loc(dModValue))
  iRet = SafeArrayPutElement(pModValueSA, 2, loc(dModValue))
  iStatus = $cPropFrame_SetModifiers(pPropFrame, 'R1', pModValueSA, iRet)
  iRet = SafeArrayDestroy(pModValueSA)
  !switch to k-ft units
  iStatus = $cSapModel_SetPresentUnits(pSapModel, eUnits_kip_ft_F, iRet)
  !add frame object by coordinates
  cCsys = 'Global'
  dXi = 0.; dYi = 0.; dZi = 0.; dXj = 0.; dYj = 0.; dZj = 10.
  iStatus = $cSapModel_GetFrameObj(pSapModel, pFrameObj)
  iStatus = $cFrameObj_AddByCoord(pFrameObj, dXi, dYi, dZi, dXj, dYj, dZj, cFrameName(1), 'R1', '1', cCsys, iRet)
  dXi = 0.; dYi = 0.; dZi = 10.; dXj = 8.; dYj = 0.; dZj = 16.
  iStatus = $cFrameObj_AddByCoord(pFrameObj, dXi, dYi, dZi, dXj, dYj, dZj, cFrameName(2), 'R1', '2', cCsys, iRet)
  dXi = -4.; dYi = 0.; dZi = 10.; dXj = 0.; dYj = 0.; dZj = 10.
  iStatus = $cFrameObj_AddByCoord(pFrameObj, dXi, dYi, dZi, dXj, dYj, dZj, cFrameName(3), 'R1', '3', cCsys, iRet)
  !assign point object restraint at base
  saBounds%lbound = 0
  saBounds%extent = 6
  pRestraintSA = SafeArrayCreate(VT_BOOL, nDimCON, saBounds)
  bRestrained = .TRUE.
  do iCol = 0, 3
  iRet = SafeArrayPutElement(pRestraintSA, iCol, loc(bRestrained))
  end do
  bRestrained = .FALSE.
  do iCol = 4, 5
  iRet = SafeArrayPutElement(pRestraintSA, iCol, loc(bRestrained))
  end do
  iStatus = $cFrameObj_GetPoints(pFrameObj, cFrameName(1), cPointName(1), cPointName(2), iRet)
  iStatus = $cSapModel_GetPointObj(pSapModel, pPointObj)
  iItemType = eItemType_Objects
  iStatus = $cPointObj_SetRestraint(pPointObj, cPointName(1), pRestraintSA, iItemType, iRet)
  !assign point object restraint at top
  bRestrained = .TRUE.
  do iCol = 0, 1
  iRet = SafeArrayPutElement(pRestraintSA, iCol, loc(bRestrained))
  end do
  bRestrained = .FALSE.
  do iCol = 2, 5
  iRet = SafeArrayPutElement(pRestraintSA, iCol, loc(bRestrained))
  end do
  iStatus = $cFrameObj_GetPoints(pFrameObj, cFrameName(2), cPointName(1), cPointName(2), iRet)
  iItemType = eItemType_Objects
  iStatus = $cPointObj_SetRestraint(pPointObj, cPointName(2), pRestraintSA, iItemType, iRet)
  iRet = SafeArrayDestroy(pRestraintSA)
  !refresh view, update (initialize) zoom
  iStatus = $cSapModel_GetView(pSapModel, pView)
  bZoom = .FALSE.
  iWindow = 0
  iStatus = $cView_RefreshView(pView, iWindow, bZoom, iRet)
  !add load patterns
  iStatus = $cSapModel_GetLoadPatterns(pSapModel, pLoadPatterns)
  iTypleLoadPat = eLoadPatternType_Other
  dSelfWTMultiplier = 1.
  bAddLoadCase = .TRUE.
  iStatus = $cLoadPatterns_Add(pLoadPatterns, '1', iTypleLoadPat, dSelfWTMultiplier, bAddLoadCase, iRet)
  dSelfWTMultiplier = 0.
  iStatus = $cLoadPatterns_Add(pLoadPatterns, '2', iTypleLoadPat, dSelfWTMultiplier, bAddLoadCase, iRet)
  iStatus = $cLoadPatterns_Add(pLoadPatterns, '3', iTypleLoadPat, dSelfWTMultiplier, bAddLoadCase, iRet)
  iStatus = $cLoadPatterns_Add(pLoadPatterns, '4', iTypleLoadPat, dSelfWTMultiplier, bAddLoadCase, iRet)
  iStatus = $cLoadPatterns_Add(pLoadPatterns, '5', iTypleLoadPat, dSelfWTMultiplier, bAddLoadCase, iRet)
  iStatus = $cLoadPatterns_Add(pLoadPatterns, '6', iTypleLoadPat, dSelfWTMultiplier, bAddLoadCase, iRet)
  iStatus = $cLoadPatterns_Add(pLoadPatterns, '7', iTypleLoadPat, dSelfWTMultiplier, bAddLoadCase, iRet)
  !assign loading for load pattern 2
  iStatus = $cSapModel_GetFrameObj(pSapModel, pFrameObj)
  iStatus = $cFrameObj_GetPoints(pFrameObj, cFrameName(3), cPointName(1), cPointName(2), iRet)
  saBounds%lbound  = 0
  saBounds%extent  = 6
  pPointLoadValueSA = SafeArrayCreate(VT_R8, nDimCON, saBounds)
  dModValue = 0.
  do iCol = saBounds%lbound, saBounds%extent
  iRet = SafeArrayPutElement(pPointLoadValueSA, iCol, loc(dModValue))
  end do
  dModValue = -10.
  iRet = SafeArrayPutElement(pPointLoadValueSA, 2, loc(dModValue))
  bReplace = .FALSE.
  cCsys = 'Global'
  iItemType = eItemType_Objects
  iStatus = $cPointObj_SetLoadForce(pPointObj, cPointName(1), '2', pPointLoadValueSA, bReplace, cCsys, iItemType, iRet)
  iMyType  = 1
  iDir  = 10
  dDist1  = 0.
  dDist2  = 1.
  dVal1  = 1.8
  dVal2  = 1.8
  cCsys  = 'Global'
  bRelDist  = .TRUE.
  bReplace  = .TRUE.
  iItemType = eItemType_Objects
  iStatus = $cFrameObj_SetLoadDistributed(pFrameObj, cFrameName(3), '2', iMyType, iDir, dDist1, dDist2, dVal1, dVal2, cCsys, bRelDist, bReplace, iItemType, iRet)
  !assign loading for load pattern 3
  iStatus = $cFrameObj_GetPoints(pFrameObj, cFrameName(3), cPointName(1), cPointName(2), iRet)
  dModValue = 0.
  do iCol = saBounds%lbound, saBounds%extent
  iRet = SafeArrayPutElement(pPointLoadValueSA, iCol, loc(dModValue))
  end do
  dModValue = -17.2
  iRet = SafeArrayPutElement(pPointLoadValueSA, 2, loc(dModValue))
  dModValue = -54.4
  iRet = SafeArrayPutElement(pPointLoadValueSA, 4, loc(dModValue))
  bReplace = .FALSE.
  cCsys = 'Global'
  iItemType = eItemType_Objects
  iStatus = $cPointObj_SetLoadForce(pPointObj, cPointName(2), '3', pPointLoadValueSA, bReplace, cCsys, iItemType, iRet)
  iRet = SafeArrayDestroy(pPointLoadValueSA)
  !assign loading for load pattern 4
  iMyType  = 1
  iDir  = 11
  dDist1  = 0.
  dDist2  = 1.
  dVal1  = 2.
  dVal2  = 2.
  cCsys  = 'Global'
  bRelDist  = .TRUE.
  bReplace  = .TRUE.
  iItemType = eItemType_Objects
  iStatus = $cFrameObj_SetLoadDistributed(pFrameObj, cFrameName(2), '4', iMyType, iDir, dDist1, dDist2, dVal1, dVal2, cCsys, bRelDist, bReplace, iItemType, iRet)
  !assign loading for load pattern 5
  iMyType  = 1
  iDir  = 2
  dDist1  = 0.
  dDist2  = 1.
  dVal1  = 2.
  dVal2  = 2.
  cCsys  = 'Local'
  bRelDist  = .TRUE.
  bReplace  = .TRUE.
  iItemType = eItemType_Objects
  iStatus = $cFrameObj_SetLoadDistributed(pFrameObj, cFrameName(1), '5', iMyType, iDir, dDist1, dDist2, dVal1, dVal2, cCsys, bRelDist, bReplace, iItemType, iRet)
  dVal1 = -2.
  dVal2 = -2.
  iStatus = $cFrameObj_SetLoadDistributed(pFrameObj, cFrameName(2), '5', iMyType, iDir, dDist1, dDist2, dVal1, dVal2, cCsys, bRelDist, bReplace, iItemType, iRet)
  !assign loading for load pattern 6
  iMyType  = 1
  iDir  = 2
  dDist1  = 0.
  dDist2  = 1.
  dVal1  = 0.9984
  dVal2  = 0.3744
  cCsys  = 'Local'
  bRelDist  = .TRUE.
  bReplace  = .TRUE.
  iItemType = eItemType_Objects
  iStatus = $cFrameObj_SetLoadDistributed(pFrameObj, cFrameName(1), '6', iMyType, iDir, dDist1, dDist2, dVal1, dVal2, cCsys, bRelDist, bReplace, iItemType, iRet)
  dVal1 = -0.3744
  dVal2 = 0.
  iStatus = $cFrameObj_SetLoadDistributed(pFrameObj, cFrameName(2), '6', iMyType, iDir, dDist1, dDist2, dVal1, dVal2, cCsys, bRelDist, bReplace, iItemType, iRet)
  !assign loading for load pattern 7
  iMyType  = 1
  iDir  = 2
  dDist1  = 0.5
  dVal1  = -15.
  cCsys  = 'Local'
  bRelDist  = .TRUE.
  bReplace  = .TRUE.
  iItemType = eItemType_Objects
  iStatus = $cFrameObj_SetLoadPoint(pFrameObj, cFrameName(2), '7', iMyType, iDir, dDist1, dVal1, cCsys, bRelDist, bReplace, iItemType, iRet)
  !switch to k-in units
  iStatus = $cSapModel_SetPresentUnits(pSapModel, eUnits_kip_in_F, iRet)
  !save model
  iStatus = $cFile_Save(pFile, cModelPath, iRet)
  !run model (this will create the analysis model)
  iStatus = $cSapModel_GetAnalyze(pSapModel, pAnalyze)
  iStatus = $cAnalyze_RunAnalysis(pAnalyze, iRet)
  !initialize for Sap2000 results
  iStatus = $cFrameObj_GetPoints(pFrameObj, cFrameName(2), cPointName(1), cPointName(2), iRet)
  !get Sap2000 results for load patterns 1 through 7
  saBounds%lbound = 0
  saBounds%extent = 0
  pObjSA = SafeArrayCreate(VT_BSTR, nDimCON, saBounds)
  pElmSA = SafeArrayCreate(VT_BSTR, nDimCON, saBounds)
  pLCaseSA = SafeArrayCreate(VT_BSTR, nDimCON, saBounds)
  pStepTypeSA = SafeArrayCreate(VT_BSTR, nDimCON, saBounds)
  pStepNumSA = SafeArrayCreate(VT_R8, nDimCON, saBounds)
  pU1SA = SafeArrayCreate(VT_R8, nDimCON, saBounds)
  pU2SA = SafeArrayCreate(VT_R8, nDimCON, saBounds)
  pU3SA = SafeArrayCreate(VT_R8, nDimCON, saBounds)
  pR1SA = SafeArrayCreate(VT_R8, nDimCON, saBounds)
  pR2SA = SafeArrayCreate(VT_R8, nDimCON, saBounds)
  pR3SA = SafeArrayCreate(VT_R8, nDimCON, saBounds)
  dSapResultsRA1(:) = 0.
  iItemType = eItemTypeElm_ObjectElm
  bSelected = .TRUE.
  iStatus = $cSapModel_GetResults(pSapModel, pAnalysisResults)
  do iCol = 0, 6
  iStatus = $cAnalysisResults_GetSetup(pAnalysisResults, pAnalysisResultsSetup)
  write (cLoadPat, '(I1)') iCol+1
  iStatus = $cAnalysisResultsSetup_DeselectAllCasesAndCombosForOutput(pAnalysisResultsSetup, iRet)
  iStatus = $cAnalysisResultsSetup_SetCaseSelectedForOutput(pAnalysisResultsSetup, cLoadPat, bSelected, iRet)
  if (iCol <= 3) then
  iStatus = $cAnalysisResults_JointDispl(pAnalysisResults, cPointName(2), iItemType, iNumberResults, pObjSA, pElmSA, pLCaseSA, pStepTypeSA, pStepNumSA, pU1SA, pU2SA, pU3SA, pR1SA, pR2SA, pR3SA, iRet)
  iRet = SafeArrayGetElement(pU3SA, 0, loc(dModValue))
  else
  iStatus = $cAnalysisResults_JointDispl(pAnalysisResults, cPointName(1), iItemType, iNumberResults, pObjSA, pElmSA, pLCaseSA, pStepTypeSA, pStepNumSA, pU1SA, pU2SA, pU3SA, pR1SA, pR2SA, pR3SA, iRet)
  iRet = SafeArrayGetElement(pU1SA, 0, loc(dModValue))
  end if
  dSapResultsRA1(iCol+1) = dModValue
  end do
  !close Sap2000 application
  bFileSave = .FALSE.
  iStatus = $cOAPI_ApplicationExit(pSapObject, bFileSave, iRet)
  !release Sap2000 object
  iStatus = cOMReleaseObject(pSapObject)
  !uninitialize COM
  call COMUninitialize()
  !deallocate SafeArrays
  iRet = SafeArrayDestroy(pObjSA)
  iRet = SafeArrayDestroy(pElmSA)
  iRet = SafeArrayDestroy(pLCaseSA)
  iRet = SafeArrayDestroy(pStepTypeSA)
  iRet = SafeArrayDestroy(pStepNumSA)
  iRet = SafeArrayDestroy(pU1SA)
  iRet = SafeArrayDestroy(pU3SA)
  iRet = SafeArrayDestroy(pR1SA)
  iRet = SafeArrayDestroy(pR2SA)
  iRet = SafeArrayDestroy(pR3SA)
  !fill independent results
  dIndResultsRA1(1) = -0.02639
  dIndResultsRA1(2) =  0.06296
  dIndResultsRA1(3) =  0.06296
  dIndResultsRA1(4) = -0.29630
  dIndResultsRA1(5) =  0.31250
  dIndResultsRA1(6) =  0.11556
  dIndResultsRA1(7) =  0.00651
  !display results
  print *, 'LC  Sap2000  Independent  %Diff'
  print *, '--  --------  -----------  -----'
  do iCol = 1, 7
  print 1, iCol, dSapResultsRA1(iCol), dIndResultsRA1(iCol), (dSapResultsRA1(iCol) /  dIndResultsRA1(iCol)) - 1.
  end do
1  format ( i3, f10.5, f13.5, f7.2)
  pause
  end program APIExample
Release Notes
Initial release in version 15.0.1.